<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Untitled Document</title>
<style type="text/css">
<!--
.style1 {font-family: Arial, Helvetica, sans-serif}
.style2 {
	font-family: Arial, Helvetica, sans-serif;
	font-weight: bold;
	font-size: 24px;
}
.style3 {
	font-size: 18px;
	font-family: Arial, Helvetica, sans-serif;
}
.style4 {font-family: Arial, Helvetica, sans-serif; font-size: 18px; }
.style5 {font-size: 18px}
-->
</style>
</head>

<body>
<p align="center" class="style2">Que herramientas necesitas para comenzar a trabajar con arduino?</p>
<p align="center" class="style1"><span class="style3"><strong>Mesa de trabajo</strong></span></p>
<p align="justify" class="style1"><span class="style3"><br />
  <strong>Lo  primero </strong>que debes  tener en tu taller <strong>es una mesa o banco de trabajo donde realizar&aacute;s tus  proyectos y experimentos</strong>. Una mesa o escritorio de madera con una  superficie de 1 metro de ancho y 70 cm de largo suele ser suficiente, aunque si  puede ser m&aacute;s ancha mejor.&nbsp;<br />
  De seguro  que tienes una mesa en tu casa que puedes utilizar para esto. De no ser as&iacute;  puedes dar un vistazo en Amazon, donde puedes encontrar mesas de trabajo muy  pr&aacute;cticas con precios asequibles.</span></p>
<p align="center" class="style4"><img src="imagenes/01-mesa-de-trabajo.jpg" width="280" height="187" /></p>
<p align="justify" class="style4">&nbsp;</p>
<p align="center" class="style4"><strong>Instalaci&oacute;n el&eacute;ctrica</strong></p>
<p class="style4"><br />
  Lo  pr&oacute;ximo que debes garantizar es <strong>tener cerca de la mesa una toma de corriente  electr&oacute;nica</strong>. En caso de que el &aacute;rea que est&eacute;s utilizando no posea ninguna  toma de corriente ser&aacute; necesario utilizar una extensi&oacute;n con tomas m&uacute;ltiples  (tambi&eacute;n conocida como <strong>regleta o cable alargador</strong>). De esta forma tambi&eacute;n  garantizas que puedas conectar varios dispositivos juntos.<br />
En Amazon  los puedes encontrar de todos tipos y formas: verticales, horizontales, con  forma de rodillo, etc. Sin embargo debes tener en cuenta dos cuestiones  fundamentales:</p>
<div align="justify" class="style1">
  <ul type="disc" class="style5">
    <li><strong>El largo del cable</strong>: debes comprobar que el       largo del cable sea suficiente como para ir desde la toma m&aacute;s cercana       hasta tu mesa de trabajo.</li>
  </ul>
</div>
<p align="justify" class="style4"><strong>Cantidad de enchufes</strong>: lo recomendable es contar con no menos de tres  enchufes en tu mesa de trabajo, de esa forma podr&aacute;s conectar el ordenador junto  a otros equipos. </p>
<p align="center" class="style4"><img src="imagenes/08-tomacorrientes-multiple-300x300.jpg" width="300" height="300" /></p>
<h4 align="center" class="style4"><strong>Gavetas, estantes y organizadores</strong></h4>
<p align="justify" class="style4">Si quieres ayudar a que tu <strong>&aacute;rea de trabajo se mantenga ordenada y  limpia</strong> siempre es &uacute;til contar con uno o varios <strong>organizadores o  estantes</strong>. Los hay de todos los tama&ntilde;os y tipos.&nbsp;<br />
  Si lo necesitas para guardar tus <strong>componentes electr&oacute;nicos</strong> puedes utilizar una o varias cajoneras de pl&aacute;stico peque&ntilde;as. Por otra parte, si  lo necesitas para guardar <strong>herramientas o proyectos</strong> de mayor  tama&ntilde;o lo m&aacute;s recomendable es utilizar un organizador con cajones grandes y  espaciosos.</p>
<p align="center" class="style4"><img src="imagenes/13-gavetas-de-acrilico-300x254.jpg" width="300" height="254" /></p>
<h3 align="center" class="style4">Computador con conexi&oacute;n a internet</h3>
<p align="justify" class="style4">&nbsp;</p>
<p align="justify" class="style4">Si bien no es imprescindible, te conviene tener un ordenador con internet en  tu taller. En caso de que poseas un ordenador port&aacute;til basta con que reserves  un espacio en tu mesa.</p>
<p align="justify" class="style4">Esto te ahorrar&aacute; mucho trabajo, sobre todo a la  hora de seguir tutoriales o montar <strong>proyectos con Arduino</strong>.</p>
<p align="justify" class="style4">&nbsp;</p>
<p align="justify" class="style4">&nbsp;</p>
<h2 align="center" class="style4">Herramientas y componentes electr&oacute;nicos para empezar</h2>
<p align="justify" class="style4">&nbsp;</p>
<p align="justify" class="style4">Ya tienes los accesorios que te permitir&aacute;n armar tu <strong>taller de  electr&oacute;nica </strong><em><strong>maker</strong></em> y mantenerlo  ordenado. Ahora ver&aacute;s las herramientas electr&oacute;nicas y componentes que no te  deben faltar para realizar proyectos de electr&oacute;nica con Arduino y ESP8266.</p>
<h3 align="justify" class="style4"><strong>Herramientas de electr&oacute;nica  b&aacute;sicas</strong></h3>
<p align="justify" class="style4">Comenzamos con las herramientas electr&oacute;nicas.</p>
<h3 align="justify" class="style4"><strong>Placas de prototipo  (Protoboard)&nbsp;</strong></h3>
<p align="justify" class="style4">&nbsp;</p>
<p align="center" class="style4"><img src="imagenes/15-protoboard.jpg" width="338" height="185" /></p>
<p align="justify" class="style4"><strong>Los cables macho-macho son  aquellos que en sus dos extremos poseen puntas </strong>para ser  insertados los orificios de una <em>protoboard</em>, de  esta forma se utilizan para conectar los componentes electr&oacute;nicos.</p>
<p align="center" class="style4"><img src="imagenes/17-cables-de-conexion.jpg" width="277" height="191" /></p>
<p align="justify" class="style4">&nbsp;</p>
<p align="justify" class="style4">De igual forma, pueden ser empleados para conectar los pines de la <strong>placa  Arduino</strong> a la placa de prototipos.<br />
  <strong>Los cables hembra-hembra</strong>, como su nombre lo indica, son  aquellos que en <strong>sus dos terminaciones poseen conectores hembra</strong>.  En la siguiente imagen puedes ver un conjunto de estos cables.</p>
<p align="center" class="style4"><img src="imagenes/18-cables-de-conexion-hembra-300x248.jpg" width="300" height="248" /></p>
<p align="justify" class="style4">&nbsp;</p>
<p align="justify" class="style4">&nbsp;</p>
<p align="justify" class="style4">Son utilizados para conectar dos componentes entre s&iacute; cuando no dispones de <em>protoboard</em> o en caso de que sea un montaje muy simple.</p>
<p align="justify" class="style4">Por &uacute;ltimo, <strong>los  cables hembra-macho son una combinaci&oacute;n de los dos anteriores</strong>,  es decir, en un terminal son machos y en el otro son hembras</p>
<p align="center" class="style4"><img src="imagenes/19-cables-de-conexion-macho-hembra.jpg" width="650" height="205" /></p>
<p align="justify" class="style4">&nbsp;</p>
<p align="justify" class="style4">&nbsp;</p>
<h3 align="center" class="style4">Fuente de alimentaci&oacute;n</h3>
<p align="justify" class="style4">&nbsp;</p>
<p align="justify" class="style4">Una herramienta que definitivamente te har&aacute; la vida m&aacute;s f&aacute;cil es una fuente  de alimentaci&oacute;n ajustable. Con este dispositivo <strong>podr&aacute;s disponer de los  voltajes que necesites para tus proyectos</strong>, no importa si son 3.3, 5 o  12 voltios, con una fuente ajustable puedes obtener cualquiera de estos valores  para alimentar tu prototipo.<br />
  Para empezar a realizar <strong>proyectos con Arduino y ESP8266</strong> no  es necesario que te gastes un past&oacute;n en una fuente profesional. Puedes comenzar  con una fuente regulable o fija de 12 voltios.</p>
<p align="center" class="style4"><img src="imagenes/20-fuente-de-alimentacion.jpg" width="261" height="226" />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <img src="imagenes/21-fuente-de-alimentacion-multi-conector.jpg" width="228" height="303" /></p>
<p align="justify" class="style4">&nbsp;</p>
<h3 align="center" class="style4">Mult&iacute;metro</h3>
<p align="justify" class="style4">&nbsp;</p>
<p align="justify" class="style4">El <strong>mult&iacute;metro</strong> es una <strong>herramienta de medici&oacute;n  imprescindible en la electr&oacute;nica</strong>. Con este puedes <strong>medir  voltaje, corriente, resistencia, continuidad, probar transistores</strong>,  etc. Es como una navaja suiza, un todo en uno. Precisamente por eso no te puede  faltar.<br />
  En el mercado existen multitud de modelos y tipos. Si est&aacute;s empezando lo  mejor es que consigas un <strong>modelo de estudiante</strong>. Estos son  econ&oacute;micos y presentan caracter&iacute;sticas t&eacute;cnicas aceptables para incursionar en  el <strong>mundillo de Arduino</strong>.</p>
<p align="center" class="style4"><img src="imagenes/27-tester.jpg" width="245" height="315" /></p>
<p align="justify" class="style4">&nbsp;</p>
<h3 align="center" class="style4">Soldador tipo l&aacute;piz o Caut&iacute;n</h3>
<p align="justify" class="style4">&nbsp;</p>
<p align="justify" class="style4">Un soldador tipo l&aacute;piz o caut&iacute;n no te puede faltar en tu mesa de trabajo,  aun cuando no tengas pensado hacer un montaje final de tus prototipos en un PCB. La cuesti&oacute;n es que muchos <strong>m&oacute;dulos y sensores</strong> vienen con sus pines sin soldar, por lo tanto, tendr&aacute;s que hacerlo t&uacute; de forma  manual.<br />
  En Amazon la variedad de soldadores es incre&iacute;ble, pero para empezar no  tienes que comprarte algo demasiado especial. Con un <strong>caut&iacute;n de entre 20  y 40 vatios</strong> es m&aacute;s que suficiente para la mayor&iacute;a de los <strong>proyectos  con Arduino</strong> que te plantees.</p>
<p align="justify" class="style4">En  algunos casos, los soldadores vienen acompa&ntilde;ados con otras herramientas como:</p>
<div align="justify" class="style1">
  <ul type="disc" class="style5">
    <li><strong>Base para soldador</strong>: es una base en la que       puedes apoyar el caut&iacute;n mientras no lo est&aacute;s utilizando.</li>
    <li><strong>Bomba de Desoldar</strong>: utilizado para desoldar       componentes.</li>
    <li><strong>Puntas</strong>: distintas puntas para poder       realizar distintos tipos de soldaduras.</li>
    <li><strong>Esta&ntilde;o</strong>: Necesario para poder       realizar las soldaduras.</li>
  </ul>
  <span class="style5">Si dispones del dinero, comprar un kit con estas  caracter&iacute;sticas es la mejor opci&oacute;n. </span></div>
<p align="center" class="style4"><img src="imagenes/33-conjunto-soldador-300x300.jpg" width="300" height="300" /></p>
<p align="justify" class="style4">&nbsp;</p>
<h3 align="center" class="style4">Tercer brazo o base para soldar</h3>
<p align="justify" class="style4">Si no tienes experiencia soldando te voy a adelantar algo: <strong>en  ocasiones necesitas tres manos</strong>.<br />
  Parece algo simple, pero imag&iacute;nate: en una mano el soldador y en la otra el  esta&ntilde;o. Entonces, &iquest;C&oacute;mo haces para sostener la placa o el componente que vas a  soldar?<br />
  Por suerte, para nosotros ya existe soluci&oacute;n para ese problema y son las  llamadas <strong>bases para soldar</strong>, tambi&eacute;n denominadas<strong> tercer  brazo</strong> &iquest;adivinas por qu&eacute;?.&nbsp;<br />
  La variedad de estos es realmente abrumadora: algunos traen lupas, base para  el soldador, luces, etc. Pero lo importante es que te permita sujetar los  componentes o m&oacute;dulos con los que vayas a trabajar.</p>
<p align="center" class="style4"><img src="imagenes/36-tercer-mano-176x300.jpg" width="176" height="300" /></p>
<p align="justify" class="style4">&nbsp;</p>
<p align="center" class="style4"><strong>Alfombrilla o tapete</strong></p>
<p align="justify" class="style4"><br />
  Es  probable que necesites cuidar tu mesa de trabajo si reparas o cacharreas con  electr&oacute;nica.<br />
  Por eso  recomiendo usar estas alfombrillas de silicona. Aqu&iacute; van algunas de sus  caracter&iacute;sticas:</p>
<div align="justify" class="style1">
  <ul type="disc" class="style5">
    <li>Zona magn&eacute;tica para no       perder los peque&ntilde;os tornillos.</li>
    <li>Huecos para organizar       herramientas.</li>
    <li>Soporta altas temperaturas.</li>
  </ul>
</div>
<p align="justify" class="style4">Si  decides usar su funci&oacute;n antiest&aacute;tica, no olvides conectar la masa.</p>
<p align="center" class="style4"><img src="imagenes/Alfombrilla-de-silicona.jpg" width="381" height="250" /></p>
<p align="justify" class="style4">&nbsp;</p>
<p align="justify" class="style4">&nbsp;</p>
<h3 align="center" class="style4">Componentes electr&oacute;nicos para principiantes</h3>
<p align="justify" class="style4">&nbsp;</p>
<p align="justify" class="style4">Es realmente complejo determinar qu&eacute; componentes electr&oacute;nicos puedes llegar  a necesitar, ya que eso depende de cada proyecto en particular. Sin embargo,  hay un grupo de componentes de uso com&uacute;n que no puedes dejar de tener en tu  taller.&nbsp;<br />
  Me refiero a componentes que te ser&aacute;n &uacute;tiles en casi cualquier proyecto: <strong>resistencias,  condensadores, LEDs</strong>, etc.</p>
<p align="center" class="style4"><img src="imagenes/38-componentes-electronicos-270x300.jpg" width="270" height="300" /></p>
<p align="justify" class="style4">&nbsp;</p>
<h4 align="center" class="style4">Resistencias</h4>
<p align="justify" class="style4">Pr&aacute;cticamente cualquier <strong>proyecto con Arduino</strong> necesita  resistencias. Ya sea para <strong>encender un</strong> <strong>LED</strong>,  controlar un motor o utilizar un bot&oacute;n, vas a necesitar resistencias. Por lo  tanto, no pueden faltar entre tus componentes una buena variedad de valores.<br />
  En Amazon puedes comprar kits de resistencias a muy buenos precios. La  mayor&iacute;a de esos kits cuentan con una amplia variedad de valores, priorizando  aquellas de uso frecuente.</p>
<p align="justify" class="style4">&nbsp;</p>
<p align="center" class="style4"><img src="imagenes/39-condensadores-electroliticos-300x300.jpg" width="300" height="300" /></p>
<h4 align="center" class="style4">Capacitores o condensadores</h4>
<p align="justify" class="style4">Otro componente de uso com&uacute;n son los <strong>condensadores</strong>. Estos  son muy empleados para <strong>filtrar se&ntilde;ales anal&oacute;gicas</strong>, eliminar el <strong>efecto rebote de los pulsadores</strong>, <strong>estabilizar fuentes  de voltaje</strong> y un largo etc.<br />
  Es complicado determinar qu&eacute; valores obtener. Lo mejor es comprar uno o  varios kits de condensadores que vienen equipados con los valores m&aacute;s comunes.<br />
  Debes tener en cuenta que existen varios <strong>tipos de condensadores</strong>.  Mi consejo es que obtengas al menos <strong>dos kits</strong>: uno con <strong>condensadores  electrol&iacute;ticos</strong> y otro con <strong>condensadores cer&aacute;micos o de  pel&iacute;cula de poli&eacute;ster</strong>.<br />
  Los primeros te ser&aacute;n &uacute;tiles para <strong>estabilizar fuentes de tensi&oacute;n</strong> y <strong>filtrar se&ntilde;ales</strong>; los &uacute;ltimos los puedes emplear en <strong>circuitos  osciladores</strong>, para reducir la <strong>interferencia electromagn&eacute;tica</strong> y <strong>reducir el efecto rebote</strong>.</p>
<p align="justify" class="style4">&nbsp;</p>
<p align="center" class="style4"><img src="imagenes/44-interruptor.jpg" width="302" height="272" /></p>
<h4 align="center" class="style4">Interruptores y pulsadores</h4>
<p align="justify" class="style4">Siempre es &uacute;til tener algunos <strong>pulsadores</strong> <strong>e interruptores</strong> guardados en tu  taller, de seguro que ya los has empleado alguna vez en tus proyectos. Lo mismo  te pueden servir para controlar la alimentaci&oacute;n de tu proyecto que para  interactuar con la <strong>placa Arduino</strong> directamente</p>
<p align="justify" class="style4">&nbsp;</p>
<p align="center" class="style4"><img src="imagenes/47-diodo-LED-264x300.jpg" width="264" height="300" /></p>
<h4 align="center" class="style4">LEDs</h4>
<p align="justify" class="style4">Nada es m&aacute;s pr&aacute;ctico y simple que utilizar uno (o varios LEDs) para indicar sucesos con tu <strong>Arduino</strong>.  Ya puede ser para determinar cu&aacute;ndo una <strong>bater&iacute;a est&aacute; baja</strong> o si  la<strong> temperatura ha subido demasiado</strong>, el caso es que utilizar <strong>LEDs con Arduino</strong> siempre es una opci&oacute;n vistosa.<br />
  En Amazon hay infinidad de<strong> kits de LEDs</strong> a precios m&oacute;dicos.  Por lo general, los kits cuentan con <strong>LEDs </strong>de varios tipos,  colores y tama&ntilde;os; as&iacute; garantizas que tu compra sea &uacute;til para cualquier  proyecto.</p>
<p align="justify" class="style4">&nbsp;</p>
<p align="center" class="style4"><img src="imagenes/49-potenciometro-convencional-rotativo-300x300.jpg" width="300" height="300" /></p>
<h4 align="center" class="style4">Potenci&oacute;metros</h4>
<p align="justify" class="style4">Otro componente que vale la pena tener a mano son los potenci&oacute;metros. Estos componentes funcionan como una  resistencia a la que se puede cambiar su valor girando o deslizando alg&uacute;n tipo  de control.</p>
<p align="justify" class="style4">&nbsp;</p>
<p align="justify" class="style4">&nbsp;</p>
<p class="style1">&nbsp;</p>
</body>

</html>
