<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Untitled Document</title>
<style type="text/css">
<!--
.style1 {font-family: Arial, Helvetica, sans-serif}
-->
</style>
</head>

<body>
<h2 align="center" class="style1">&iquest;Para que sirve Arduino?</h2>
<p class="style1">&nbsp;</p>
<p class="style1">Arduino es libre y extensible: as&iacute; cualquiera que desee ampliar y   mejorar el dise&ntilde;o hardware de las placas como el entorno de desarrollo,   puede hacerlo sin problemas. Esto permite que exista un rico ecosistema   de placas electr&oacute;nicas no oficiales para distintos prop&oacute;sitos y de   librer&iacute;as de software de tercero, que pueden adaptarse mejor a nuestras   necesidades.</p>
<p align="center" class="style1"><img src="imagenes/1024_0.jpg" width="315" height="346" /></p>
<p class="style1"><strong>Arduino tiene una gran comunidad: </strong>Gracias a su gran   alcance hay un gran comunidad trabajando con esta plataforma. As&iacute; se   genera una cantidad de documentaci&oacute;n bastante extensa, la cual abarca   casi cualquier necesidad.</p>
<p class="style1"><strong>Su entorno de programaci&oacute;n es multiplataforma. </strong>Se puede instalar y ejecutar en sistemas operativos Windows, Mac OS y Linux.</p>
<p class="style1"><strong>Lenguaje de programaci&oacute;n de f&aacute;cil compresi&oacute;n.</strong>&nbsp;Su   lenguaje de programaci&oacute;n basado en C++ es de f&aacute;cil compresi&oacute;n. C++   permite una entrada sencilla a los nuevos programadores y a la vez con   una capacidad tan grande, que los programadores mas avanzados pueden   exprimir todo el potencial de su lenguaje y adaptarlo a cualquier   situaci&oacute;n.</p>
<p class="style1"><strong>Bajo costo. </strong>La placa Arduino est&aacute;ndar (Arduino UNO)   tiene un valor aproximado de $7(a la tasa de cambio en Venezuela). Incluso uno mismo   la podr&iacute;a construir(una gran ventaja del hardware libre), con lo que el   precio de la placa seria incluso menor.</p>
<p class="style1"><strong>Re-usabilidad y versatilidad.</strong>&nbsp;Es   re-utilizable porque una vez terminado el proyecto es muy f&aacute;cil poder   desmontar los componentes externos a la placa y empezar con un nuevo   proyecto. De igual manera todos los pines del microcontrolador est&aacute;n   accesibles a trav&eacute;s de conectores hembra y esto permite sacar partido de   todas las bondades del microcontrolador con un riesgo muy bajo de hacer   una conexi&oacute;n err&oacute;nea.</p>
</body>
</html>
