<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Untitled Document</title>
<style type="text/css">
<!--
.style1 {font-family: Arial, Helvetica, sans-serif}
-->
</style>
</head>

<body>
<h2 align="center" class="style1">&iquest;Qu&eacute; es Arduino?</h2>
<p class="style1">Arduino es una plataforma de desarrollo basada en una placa electr&oacute;nica de   hardware libre que incorpora un microcontrolador re-programable y una   serie de pines hembra. Estos permiten establecer conexiones entre el   microcontrolador y los diferentes sensores y actuadores de una manera muy sencilla (principalmente con cables dupont).</p>
<p class="style1">&nbsp;</p>
<p align="center" class="style1"><img src="imagenes/2018-12-27-17_32_24-Window-e1683927716802.png" width="506" height="222" /></p>
<p class="style1">Una placa electr&oacute;nica es una PCB (&ldquo;Printed Circuit Board&rdquo;, &ldquo;Placa de Circuito Impreso&rdquo; en espa&ntilde;ol). Las PCBs superficies planas fabricadas en un material no conductor, la cual costa de distintas capas de material conductor. Una PCB es la forma m&aacute;s compacta y estable de construir un circuito   electr&oacute;nico. Por lo tanto, la placa Arduino no es m&aacute;s que una PCB que   implementa un determinado dise&ntilde;o de circuiter&iacute;a interna. De esta forma   el usuario final no se debe preocupar por las conexiones el&eacute;ctricas que   necesita el microcontrolador para funcionar, y puede empezar   directamente a desarrollar las diferentes aplicaciones electr&oacute;nicas que   necesite.</p>
<p align="center" class="style1"><img src="imagenes/0140426601151m.jpg" width="232" height="218" /></p>
<div class="style1"><strong>PCB de un Arduino UNO</strong></div>
<p class="style1">Cuando hablamos de &ldquo;Arduino&rdquo; deber&iacute;amos especificar el modelo concreto. Se han fabricado diferentes modelos de placas Arduino oficiales,   cada una pensada con un prop&oacute;sito diferente y caracter&iacute;sticas variadas   (como el tama&ntilde;o f&iacute;sico, n&uacute;mero de pines E/S, modelo del   microcontrolador, etc). A pesar de las varias placas que existen todas   pertenecen a la misma familia (microcontroladores AVR marca Atmel). Esto   significa que comparten la mayor&iacute;a de sus caracter&iacute;sticas de software,   como arquitectura, librer&iacute;as y documentaci&oacute;n.</p>
<p class="style1">&nbsp;</p>
</body>
</html>
