<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Untitled Document</title>
<style type="text/css">
<!--
.style1 {
	font-size: 24px;
	font-weight: bold;
}
.style2 {font-size: 24px; font-weight: bold; color: #006600; }
.style3 {color: #FF6600}
-->
</style>
</head>

<body>
<form action="" method="post" name="form1" class="style2" id="form1">
   Bienvenidos al facinante mundo de <span class="style3">ARDUINO</span>
</form>
<p>&nbsp;</p>
<p align="center" class="style1">&iquest;Alguna vez te has preguntado qu&eacute; es Arduino y por   qu&eacute; todo el mundo habla de &eacute;l?</p>
<p>&nbsp;</p>
<p align="justify">	&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Pues no busques m&aacute;s, porque aqu&iacute; te   traemos una gu&iacute;a completa para que descubras el fascinante mundo de esta plataforma electr&oacute;nica de c&oacute;digo abierto. </p>
<p><img src="imagenes/dNk0K5-C_400x400.jpg" width="266" height="400" align="left" />Desde sus inicios, Arduino ha logrado posicionarse   como l&iacute;der en la comunidad de c&oacute;digo abierto gracias a su ecosistema   formado por una gran variedad de hardware y software.</p>
<p><img src="imagenes/dNk0K5-C_400x400.jpg" width="263" height="400" align="right" /></p>
<p align="justify">Su versatilidad y facilidad de uso lo convierten en la opci&oacute;n   predilecta para un amplio abanico de usuarios, desde aficionados hasta   profesionales del dise&ntilde;o y prototipado de productos.</p>
<p align="justify">Arduino es una de las placas m&aacute;s populares del mundo. Su versatilidad y   la infinidad de posibilidades que ofrece la convierten en una de las   herramientas de programaci&oacute;n m&aacute;s completas del mercado. Si no sabes qu&eacute;   es un arduino, est&aacute;s en el lugar indicado: a continuaci&oacute;n te   explicaremos qu&eacute; es y para qu&eacute; sirve un arduino.</p>
<p align="justify">Esta plataforma se inici&oacute; en el a&ntilde;o 2005 como un proyecto para   estudiantes en el Instituto IVREA, en Ivrea (Italia). En ese tiempo, los   estudiantes usaban el microcontrolador BASIC Stamp, cuyo coste era de   100 d&oacute;lares estadounidenses, lo que se consideraba demasiado costoso   para ellos. Por aquella &eacute;poca, uno de los fundadores de Arduino, Massimo   Banzi, daba clases en Ivrea.</p>
<p align="justify">El nombre del proyecto viene del nombre del Bar di Re Arduino (Bar   del Rey Arduino) donde Massimo Banzi pasaba algunas horas. El rey   Arduino fue rey de Italia entre los a&ntilde;os 1002 y 1014.</p>
<p align="justify">En la creaci&oacute;n de este proyecto contribuy&oacute; el estudiante colombiano   Hernando Barrag&aacute;n, quien desarroll&oacute; la tarjeta electr&oacute;nica Wiring, el   lenguaje de programaci&oacute;n y la plataforma de desarrollo.&nbsp; Una vez   concluida dicha plataforma, los investigadores trabajaron para hacerlo   m&aacute;s ligero, econ&oacute;mico y disponible para la comunidad de <strong>software libre</strong> (hardware y c&oacute;digo abierto). El instituto finalmente cerr&oacute; sus puertas,   as&iacute; que los investigadores, entre ellos el espa&ntilde;ol David Cuartielles,   promovieron la idea. Banzi afirmar&iacute;a a&ntilde;os m&aacute;s tarde que el proyecto   nunca surgi&oacute; como una idea de negocio, sino como una necesidad de   subsistir ante el inminente cierre del Instituto de dise&ntilde;o Interactivo   IVREA. El motivo es que al crear un producto de hardware abierto, nadie   podr&iacute;a embargarlo.</p>
<p align="justify">&nbsp;</p>
<p align="justify">&nbsp;</p>
<p align="justify">&nbsp;</p>
<p align="justify">&nbsp;</p>
</body>
</html>
